STMicroelectronics/fp-sns-smartag2/Projects/STM32L4P5CG-SmarTag2/Applications/FirmwareUpdate/Inc/main.h
/**
  ******************************************************************************
  * @file    main.h
  * @author  System Research & Applications Team - Catania & Agrate Lab.
  * @version 1.0.2
  * @date    30-January-2023
  * @brief   Header for main.c file.
  *          This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32l4xx_hal.h"
  
/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

extern void Error_Handler_NFC(uint32_t ErroCode);

/* Private defines -----------------------------------------------------------*/
#define INT_PRE_Pin GPIO_PIN_13
#define INT_PRE_GPIO_Port GPIOC
#define INT_PRE_EXTI_IRQn EXTI15_10_IRQn
#define ISET0_Pin GPIO_PIN_15
#define ISET0_GPIO_Port GPIOC
#define IRQ_RTC_Pin GPIO_PIN_1
#define IRQ_RTC_GPIO_Port GPIOH
#define ACC_INT1_Pin GPIO_PIN_0
#define ACC_INT1_GPIO_Port GPIOA
#define RST_SAFE_Pin GPIO_PIN_1
#define RST_SAFE_GPIO_Port GPIOA
#define HIGH_G_INT1_Pin GPIO_PIN_2
#define HIGH_G_INT1_GPIO_Port GPIOA
#define INT_TEM_Pin GPIO_PIN_4
#define INT_TEM_GPIO_Port GPIOA
#define INT_TEM_EXTI_IRQn EXTI4_IRQn
#define RECT_M_Pin GPIO_PIN_5
#define RECT_M_GPIO_Port GPIOA
#define BATT_M_Pin GPIO_PIN_6
#define BATT_M_GPIO_Port GPIOA
#define ACC_INT2_Pin GPIO_PIN_0
#define ACC_INT2_GPIO_Port GPIOB
#define VDD_SAF_CTRL_Pin GPIO_PIN_13
#define VDD_SAF_CTRL_GPIO_Port GPIOB
#define VDD_EEP_Pin GPIO_PIN_3
#define VDD_EEP_GPIO_Port GPIOA

#define GPIO1_Pin GPIO_PIN_5
#define GPIO1_GPIO_Port GPIOB

#define CH_ON_Pin GPIO_PIN_9
#define CH_ON_GPIO_Port GPIOB
/* Error Codes */
#define NFC_READING_ERROR 0
#define NFC_WRITING_ERROR 1
#define NFC_CONFIG_ERROR  2

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
